Repository: misits/Archive-Data-Loader
Catalog: languages/archive-data-loader-*.po
Languages: fr_fr

source: Archive Data Loader
fr_fr: Chargeur de données d'archives

source: A plugin to load data from an archive database into WordPress.
fr_fr: Un plugin pour charger des données d'une base de données d'archive dans WordPress.

source: Source database dumped successfully.
fr_fr: La base de données source a été copiée avec succès.

source: Failed to dump source database.
fr_fr: Échec de la copie de la base de données source.

source: Current database dumped successfully.
fr_fr: La base de données actuelle a été copiée avec succès.

source: Failed to dump current database.
fr_fr: Échec de copie de la base de données actuelle.

source: Source database restored successfully.
fr_fr: La base de données source a été restaurée avec succès.

source: Failed to restore source database.
fr_fr: Échec de la restauration de la base de données source.

source: Connection to database successful.
fr_fr: Connexion à la base de données réussie.

source: Connection to database failed.
fr_fr: La connexion à la base de données a échoué.

source: Settings saved successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Data Preview
fr_fr: Aperçu des données

source: Preview the first 5 rows of the selected table
fr_fr: Prévisualiser les 5 premières lignes du tableau sélectionné

source: Use this tool to load data from a database into WordPress.
fr_fr: Utilisez cet outil pour charger des données d'une base de données dans WordPress.

source: Warning
fr_fr: Avertissement

source: This tool will load data from an external database into your WordPress site
fr_fr: Cet outil chargera les données d'une base de données externe sur votre site WordPress

source: Make sure you have a backup of your site before proceeding
fr_fr: Assurez-vous d'avoir une sauvegarde de votre site avant de continuer

source: Database Settings
fr_fr: Paramètres de la base de données

source: Configure the connection to a database
fr_fr: Configurer la connexion à une base de données

source: Database Host
fr_fr: Hôte de base de données

source: Database User
fr_fr: Utilisateur de la base de données

source: Database Password
fr_fr: Mot de passe de la base de données

source: Database Name
fr_fr: Nom de la base de données

source: Save Settings
fr_fr: Enregistrer les paramètres

source: Test Database Connection
fr_fr: Tester la connexion à la base de données

source: Load Data
fr_fr: Charger les données

source: Map the fields from the selected table in source database to the current database
fr_fr: Mapper les champs de la table sélectionnée dans la base de données source vers la base de données actuelle

source: Source Table
fr_fr: Tableau source

source: Select a table
fr_fr: Sélectionnez une table

source: Destination Table
fr_fr: Tableau de destination

source: Post Type
fr_fr: Type de poste

source: Title Field
fr_fr: Champ de titre

source: Content Field
fr_fr: Champ de contenu

source: Date Field
fr_fr: Champ de date

source: Archive Column
fr_fr: Colonne d'archives

source: Post Meta Fields
fr_fr: Champs méta de publication

source: Add Meta
fr_fr: Ajouter des méta

source: Manage log files generated by the plugin
fr_fr: Gérer les fichiers journaux générés par le plugin

source: File Name
fr_fr: Nom de fichier

source: Size
fr_fr: Taille

source: Download
fr_fr: Télécharger

source: Delete
fr_fr: Supprimer

source: No log files available
fr_fr: Aucun fichier log disponible

source: Restore Command
fr_fr: Commande de restauration

source: Execute commands to manage database
fr_fr: Exécuter des commandes pour gérer la base de données

source: Dump Source Database
fr_fr: Copier la base de données source

source: Dump Current Database
fr_fr: Copier la base de données actuelle

source: Source DB Connection Error:
fr_fr: Erreur de connexion à la base de données source :

source: Connected to the source database.
fr_fr: Connecté à la base de données source.

source: Failed to retrieve tables from source database.
fr_fr: Échec de la récupération des tables de la base de données source.

source: Retrieved tables from source database.
fr_fr: Tables récupérées à partir de la base de données source.

source: Failed to create table
fr_fr: Échec de la création de la table

source: Created table
fr_fr: Tableau créé

source: Failed to insert/update data into
fr_fr: Impossible d'insérer/mettre à jour les données dans

source: Copied data into
fr_fr: Données copiées dans

source: Updated siteurl and home options.
fr_fr: Mise à jour du siteurl et des options d'accueil.

source: Database restoration completed successfully.
fr_fr: La restauration de la base de données a été effectuée avec succès.

source: Error during database restoration:
fr_fr: Erreur lors de la restauration de la base de données :

source: Encryption key or IV missing. Please configure properly.
fr_fr: Clé de chiffrement ou IV manquante. Veuillez configurer correctement.

source: Invalid log file specified.
fr_fr: Fichier journal spécifié non valide.

source: Log files cleared successfully.
fr_fr: Les fichiers journaux ont été effacés avec succès.

source: Log file deleted successfully.
fr_fr: Le fichier journal a été supprimé avec succès.

source: Failed to delete the log file.
fr_fr: Impossible de supprimer le fichier journal.

source: Missing or empty table parameter.
fr_fr: Paramètre de table manquant ou vide.

source: Query error:
fr_fr: Erreur de requête :
